#+TITLE:Practice: A Representative R Session
#+AUTHOR: [your name here]
#+SUBTITLE: Data visualization (DSC 302) Fall 2022
#+OPTIONS: toc:1 num:1 ^:nil
* README

  - Practice instructions for the data visualization lectures
  - Emacs + ESS + Org-mode and R must be installed
  - Upload the completed file as a class assignment ([[https://lyon.instructure.com/courses/571/assignments/1704][Canvas link]])

  #+name: tab:3_practice
  | PRACTICE         | MIN |
  |------------------+-----|
  | Prerequisites    |  15 |
  | Loading packages |  15 |
  | Looking at data  |  15 |
  | Factors vectors  |  15 |
  | Summary stats    |  15 |
  | Boxplots         |  10 |
  | Scatterplots     |  10 |
  | Bar charts       |  10 |
  | Customization    |  15 |
  |------------------+-----|
  | TOTAL            | 120 |
  #+TBLFM: @11$2=vsum(@2..@10)

** SOLUTION

   #+begin_src R :session :results output
     summary(whiteside)
   #+end_src

   #+RESULTS:
   :     Insul         Temp             Gas
   :  Before:26   Min.   :-0.800   Min.   :1.300
   :  After :30   1st Qu.: 3.050   1st Qu.:3.500
   :              Median : 4.900   Median :3.950
   :              Mean   : 4.875   Mean   :4.071
   :              3rd Qu.: 7.125   3rd Qu.:4.625
   :              Max.   :10.200   Max.   :7.200

